src_ext/InformationRegisters/УЗ_РеквизитыОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УЗ_РеквизитыОрганизаций</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИПБезЛицензии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерЛицензии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЛицензии</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛицензиюВыдал</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подписант</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДолжностьПодписанта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОснованиеПолномочий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлатежныеРеквизиты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_ext/InformationRegisters/УЗ_ЧекиККТ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УЗ_ЧекиККТ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТипЧека</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерЧека</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерСмены</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФискальныйПризнак</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЧека</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Устройство</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кассир</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Электронно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УЗ_ПриходДенег</v8:Type>
						<v8:Type>cfg:DocumentRef.УЗ_РасходДенег</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_ext/Enums/УЗ_ВидыОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>УЗ_ВидыОпераций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВнутренняяКасса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КассаУченики</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаЗарплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочийРасход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src_ext/Catalogs/УЗ_ФизЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>УЗ_ФизЛица</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Возраст</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EMail</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фото</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Фото</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Http</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОповеститьПоEmail</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОповеститьПоSMS</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОповеститьПоТелефону</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаПедагога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_СтавкиПедагогов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникИнформации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.УЗ_ИсточникиИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Родитель1Прежний</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Comment>Составной тип: пустое значение (Неопределено) — пол не указан; Булево пустым не бывает</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Статусы</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цвет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заметки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоВыбранныеГруппыОбучения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоПедагог</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выбыл</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Скидка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Скидки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Тарифы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредпочитаемыйКанал</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УЗ_КаналыСообщений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСогласия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтписки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Плательщики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Плательщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КемПриходится</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основной</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src_ext/CommonModules/УЗ_Чеки/Ext/Module.bsl
//Чеки 54-ФЗ по оплатам учеников (этап 2.2, часть 1: касса хозяина; В61, В62). Логика — docs/логики/чеки.md.
//
//Чек пробивает онлайн-касса хозяина (подключаемое оборудование УНФ, Бухгалтерии, Управления торговлей) — через
//слой УЗ_СредаКасса (сервер) и УЗ_СредаКлиент (выбор кассы и фискализация на клиенте). Здесь — что попадает в чек:
//  * приход денег «Касса ученики» — чек «Приход», позиция на каждую строку расшифровки платежа;
//  * расход денег «Касса ученики» (возврат ученику) — чек «Возврат прихода» одной позицией;
//  * «Оплата занятий: <предмет>», предмет расчёта «Услуга», без НДС, количество 1;
//  * способ расчёта (В61): абонемент и оплата вперёд — «Предоплата 100%»; часть строки без абонемента, которая
//    гасит долг за уже проведённые занятия (остаток денег ученика по предмету до документа отрицательный), —
//    «Полный расчёт»; возврат — «Предоплата 100%» (возвращается аванс);
//  * система налогообложения — из «Реквизитов организаций для справок и договоров» (В62: пусто — отказ);
//  * телефон и e-mail плательщика — для электронного чека (ОФД отправит его покупателю);
//  * кассир — полное имя пользователя.
//Пробитый чек — запись регистра УЗ_ЧекиККТ (номер, смена, фискальный признак); второй раз не пробивается.

#Область ПрограммныйИнтерфейс

//Данные чека документа простыми значениями — для кассы хозяина (УЗ_СредаКасса.ПараметрыЧекаХозяина) и проверок
//без кассы. ВидОплаты — "Наличные" или "Электронно" (карта, перевод). Структура:
//  Причина — почему чек не пробить ("" — можно); остальные поля заполнены, только если причины нет;
//  Документ, ТипРасчета ("Приход" / "ВозвратПрихода"), Организация, ОрганизацияНазвание, ОрганизацияИНН,
//  СистемаНалогообложения (имя значения ТипыСистемНалогообложенияККТ), Кассир, ВидОплаты, Сумма, Электронно,
//  ПокупательНомер ("+79123456789" или ""), ПокупательEmail, Позиции — Массив Структур (Наименование, Количество,
//  Цена, Сумма, СпособРасчета — имя значения ПризнакиСпособаРасчета, ПредметРасчета — "Услуга").
Функция ДанныеЧека(Документ, ВидОплаты = "Наличные") Экспорт

	Данные = Новый Структура("Причина, Документ, ТипРасчета, Организация, ОрганизацияНазвание, ОрганизацияИНН, "
		+ "СистемаНалогообложения, Кассир, ВидОплаты, Сумма, Электронно, ПокупательНомер, ПокупательEmail, Позиции",
		"", Документ, "", Неопределено, "", "", "", "", ВидОплаты, 0, Ложь, "", "", Новый Массив);
	Причина = ПричинаНеПробивать(Документ);
	Если Не ПустаяСтрока(Причина) Тогда
		Данные.Причина = Причина;
		Возврат Данные;
	КонецЕсли;
	Если ВидОплаты <> "Наличные" И ВидОплаты <> "Электронно" Тогда
		Данные.Причина = СтрШаблон(НСтр("ru = 'Неизвестный вид оплаты «%1»: наличными или безналичными.'"),
			ВидОплаты);
		Возврат Данные;
	КонецЕсли;

	Реквизиты = РегистрыСведений.УЗ_РеквизитыОрганизаций.РеквизитыОрганизации(Документ.Организация);
	Если ПустаяСтрока(Реквизиты.СистемаНалогообложения) Тогда
		Данные.Причина = СтрШаблон(НСтр("ru = 'Для организации «%1» не указана система налогообложения для чеков: "
			+ "«Учёт занятий» → Настройки → Реквизиты организаций, поле «Система налогообложения» (та, что указана при "
			+ "регистрации кассы).'"), Документ.Организация);
		Возврат Данные;
	КонецЕсли;
	Данные.Организация = Документ.Организация;
	Данные.ОрганизацияНазвание = Реквизиты.Наименование;
	ИНН = СокрЛП(Реквизиты.ИНН);
	Данные.ОрганизацияИНН = ?(СтрДлина(ИНН) = 10 Или СтрДлина(ИНН) = 12, ИНН, "");
	Данные.СистемаНалогообложения = Реквизиты.СистемаНалогообложения;
	Данные.Кассир = Лев(ИмяКассира(), 64);

	Если ТипЗнч(Документ) = Тип("ДокументСсылка.УЗ_РасходДенег") Тогда
		Данные.ТипРасчета = "ВозвратПрихода";
		Данные.Позиции.Добавить(Позиция(Документ.ПредметОбучения, Документ.СуммаДокумента, "ПредоплатаПолная"));
		Покупатель = ?(ЗначениеЗаполнено(Документ.Получатель), Документ.Получатель, Документ.ФизЛицо);
	Иначе
		Данные.ТипРасчета = "Приход";
		ДобавитьПозицииПрихода(Документ, Данные.Позиции);
		Покупатель = ПлательщикПрихода(Документ);
	КонецЕсли;
	Для Каждого ПозицияЧека Из Данные.Позиции Цикл
		Данные.Сумма = Данные.Сумма + ПозицияЧека.Сумма;
	КонецЦикла;
	Если ЗначениеЗаполнено(Покупатель) Тогда
		Данные.ПокупательНомер = НомерТелефона(Покупатель.Телефон);
		Данные.ПокупательEmail = ?(СтрНайти(Покупатель.EMail, "@") > 1, СокрЛП(Покупатель.EMail), "");
	КонецЕсли;
	Возврат Данные;

КонецФункции

//Подготовка чека к кассе (вызов с клиента, УЗ_ЧекиКлиент): проверки и параметры операции фискализации хозяина.
//Структура: Причина ("" — можно пробивать), ПараметрыОперации (для УЗ_СредаКлиент.НачатьФискализациюЧека),
//Сумма, ТипРасчета.
Функция ПодготовитьЧек(Документ, ВидОплаты) Экспорт

	Итог = Новый Структура("Причина, ПараметрыОперации, Сумма, ТипРасчета", "", Неопределено, 0, "");
	Если Не ПравоДоступа("Изменение", Метаданные.РегистрыСведений.УЗ_ЧекиККТ) Тогда
		Итог.Причина = НСтр("ru = 'Пробивать чеки могут менеджер и руководитель «Учёта занятий».'");
		Возврат Итог;
	КонецЕсли;
	Касса = УЗ_Среда.ОнлайнКассаХозяина();
	Если Не Касса.Есть Тогда
		Итог.Причина = Касса.Причина;
		Возврат Итог;
	КонецЕсли;
	Данные = ДанныеЧека(Документ, ВидОплаты);
	Если Не ПустаяСтрока(Данные.Причина) Тогда
		Итог.Причина = Данные.Причина;
		Возврат Итог;
	КонецЕсли;
	Если Не УЗ_СредаКасса.ЕстьОнлайнКасса() Тогда
		Итог.Причина = НСтр("ru = 'В программе не подключена онлайн-касса: подключите её в разделе администрирования "
			+ "«Подключаемое оборудование» (вид «Фискальные регистраторы», драйвер кассы, рабочее место этого "
			+ "компьютера) — и откройте кассовую смену.'");
		Возврат Итог;
	КонецЕсли;
	Попытка
		Итог.ПараметрыОперации = УЗ_СредаКасса.ПараметрыЧекаХозяина(Данные);
	Исключение
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Учёт занятий.Чеки'"), УровеньЖурналаРегистрации.Ошибка,
			Метаданные.ОбщиеМодули.УЗ_Чеки, Документ, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Итог.Причина = СтрШаблон(НСтр("ru = 'Не удалось подготовить чек для кассы: %1'"),
			КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Итог;
	КонецПопытки;
	Итог.Сумма = Данные.Сумма;
	Итог.ТипРасчета = Данные.ТипРасчета;
	Возврат Итог;

КонецФункции

//Отметка пробитого чека (после ответа кассы). Результат — Структура: НомерЧека, НомерСмены, ФискальныйПризнак,
//ДатаЧека, Устройство, Сумма, ТипРасчета, Электронно. Возвращает текст ошибки или "". Уже отмеченный чек не
//перезаписывается (двойной ответ кассы, второе окно) — ошибка «чек уже пробит».
Функция ОтметитьЧек(Документ, Результат) Экспорт

	Если Не ПравоДоступа("Изменение", Метаданные.РегистрыСведений.УЗ_ЧекиККТ) Тогда
		Возврат НСтр("ru = 'Недостаточно прав, чтобы отметить чек.'");
	КонецЕсли;
	НачатьТранзакцию();
	Попытка
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.УЗ_ЧекиККТ");
		ЭлементБлокировки.УстановитьЗначение("Документ", Документ);
		Блокировка.Заблокировать();
		Запись = РегистрыСведений.УЗ_ЧекиККТ.СоздатьМенеджерЗаписи();
		Запись.Документ = Документ;
		Запись.Прочитать();
		Если Запись.Выбран() Тогда
			ОтменитьТранзакцию();
			Возврат СтрШаблон(НСтр("ru = 'Чек по документу уже отмечен: %1'"), СведенияОЧеке(Документ));
		КонецЕсли;
		Запись.Документ = Документ;
		Запись.ТипЧека =
			?(Результат.ТипРасчета = "ВозвратПрихода", НСтр("ru = 'Возврат прихода'"), НСтр("ru = 'Приход'"));
		Запись.НомерЧека = Строка(Результат.НомерЧека);
		Запись.НомерСмены = Строка(Результат.НомерСмены);
		Запись.ФискальныйПризнак = Строка(Результат.ФискальныйПризнак);
		Запись.ДатаЧека = ?(ТипЗнч(Результат.ДатаЧека) = Тип("Дата") И ЗначениеЗаполнено(Результат.ДатаЧека),
			Результат.ДатаЧека, ТекущаяДатаСеанса());
		Запись.Сумма = Результат.Сумма;
		Запись.Устройство = Лев(Строка(Результат.Устройство), 150);
		Запись.Кассир = УЗ_Среда.ТекущийПользователь();
		Запись.Электронно = Результат.Электронно;
		Запись.Записать();
		ЗафиксироватьТранзакцию();
	Исключение
		Если ТранзакцияАктивна() Тогда
			ОтменитьТранзакцию();
		КонецЕсли;
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Учёт занятий.Чеки'"), УровеньЖурналаРегистрации.Ошибка,
			Метаданные.РегистрыСведений.УЗ_ЧекиККТ, Документ, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат СтрШаблон(НСтр("ru = 'Чек пробит, но отметка не записана: %1. Номер чека — в журнале фискальных "
			+ "операций программы.'"), КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	Возврат "";

КонецФункции

//Строка для формы документа: «Чек № 12, смена 3, 30.09.2026 12:01, ФП 1234567890 — 1 500,00» или "" (не пробит).
Функция СведенияОЧеке(Документ) Экспорт

	Если Не ЗначениеЗаполнено(Документ) Тогда
		Возврат "";
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Чеки.ТипЧека КАК ТипЧека,
	|	Чеки.НомерЧека КАК НомерЧека,
	|	Чеки.НомерСмены КАК НомерСмены,
	|	Чеки.ФискальныйПризнак КАК ФискальныйПризнак,
	|	Чеки.ДатаЧека КАК ДатаЧека,
	|	Чеки.Сумма КАК Сумма
	|ИЗ
	|	РегистрСведений.УЗ_ЧекиККТ КАК Чеки
	|ГДЕ
	|	Чеки.Документ = &Документ";
	Запрос.УстановитьПараметр("Документ", Документ);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		Возврат "";
	КонецЕсли;
	Возврат СтрШаблон(НСтр("ru = 'Чек «%1» № %2, смена %3, %4, ФП %5 — %6'"), Выборка.ТипЧека, Выборка.НомерЧека,
		Выборка.НомерСмены, Формат(Выборка.ДатаЧека, "ДЛФ=DT"), Выборка.ФискальныйПризнак,
		Формат(Выборка.Сумма, "ЧДЦ=2; ЧН=0,00"));

КонецФункции

//Чек в форме прихода или расхода денег: пробитый (номер, смена, фискальный признак) — надписью «ЧекККТ»; кнопка
//«ФормаПробитьЧек» — пока чека нет, тем, кто вправе его пробивать (менеджер, руководитель).
Процедура ПоказатьЧекВФорме(Форма, Документ) Экспорт

	Сведения = СведенияОЧеке(Документ);
	Форма.Элементы.ЧекККТ.Заголовок = Сведения;
	Форма.Элементы.ЧекККТ.Видимость = Не ПустаяСтрока(Сведения);
	Форма.Элементы.ФормаПробитьЧек.Видимость = ПустаяСтрока(Сведения)
		И ПравоДоступа("Изменение", Метаданные.РегистрыСведений.УЗ_ЧекиККТ);

КонецПроцедуры

//Пробит ли чек по документу.
Функция ЧекПробит(Документ) Экспорт

	Возврат Не ПустаяСтрока(СведенияОЧеке(Документ));

КонецФункции

//Системы налогообложения для поля реквизитов организации (СписокЗначений: имя — представление).
Функция СистемыНалогообложения() Экспорт

	Возврат УЗ_СредаКасса.СистемыНалогообложения();

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//Причина, по которой чек по документу не пробивается, или "".
Функция ПричинаНеПробивать(Документ)

	Если ТипЗнч(Документ) <> Тип("ДокументСсылка.УЗ_ПриходДенег")
		И ТипЗнч(Документ) <> Тип("ДокументСсылка.УЗ_РасходДенег") Тогда
		Возврат НСтр("ru = 'Чек пробивается по приходу денег (оплата ученика) или расходу денег (возврат ученику).'");
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Документ) Тогда
		Возврат НСтр("ru = 'Запишите и проведите документ — чек пробивается по проведённому.'");
	КонецЕсли;
	Если Не Документ.Проведен Тогда
		Возврат НСтр("ru = 'Проведите документ — чек пробивается по проведённому.'");
	КонецЕсли;
	Если Документ.ВидОперации <> Перечисления.УЗ_ВидыОпераций.КассаУченики Тогда
		Возврат СтрШаблон(НСтр("ru = 'Чек пробивается по деньгам учеников (вид «Касса ученики»), а здесь — «%1».'"),
			Документ.ВидОперации);
	КонецЕсли;
	Если Документ.СуммаДокумента <= 0 Тогда
		Возврат НСтр("ru = 'В документе нет денег для чека (сумма 0; бонусы в чек не входят).'");
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Документ.Организация) Тогда
		Возврат НСтр("ru = 'Укажите организацию — чек пробивается от её имени.'");
	КонецЕсли;
	Сведения = СведенияОЧеке(Документ);
	Если Не ПустаяСтрока(Сведения) Тогда
		Возврат СтрШаблон(НСтр("ru = 'Чек уже пробит: %1. Повторно не пробивается; исправление — чеком коррекции в "
			+ "программе.'"), Сведения);
	КонецЕсли;
	Возврат "";

КонецФункции

//Позиции чека прихода по строкам расшифровки платежа (В61): абонемент — предоплата; без абонемента — сначала долг
//ученика по предмету до документа («Полный расчёт»: занятия уже проведены), остаток — предоплата. Долг одного
//ученика и предмета гасится строками по порядку один раз.
Процедура ДобавитьПозицииПрихода(Документ, Позиции)

	Граница = Новый Граница(Документ.МоментВремени(), ВидГраницы.Исключая);
	Долги = Новый Соответствие;
	Для Каждого СтрокаОплаты Из Документ.РасшифровкаПлатежа Цикл
		Если СтрокаОплаты.Сумма <= 0 Тогда
			Продолжить;
		КонецЕсли;
		Долг = 0;
		Ключ = "";
		Если Не ЗначениеЗаполнено(СтрокаОплаты.Абонемент) Тогда
			Ключ = Строка(СтрокаОплаты.Ученик.УникальныйИдентификатор()) + "/"
				+ Строка(СтрокаОплаты.ПредметОбучения.УникальныйИдентификатор());
			Долг = Долги.Получить(Ключ);
			Если Долг = Неопределено Тогда
				Остаток = УЗ_Сервер.ОстатокДенегУченика(СтрокаОплаты.Ученик, Документ.Организация,
					?(ЗначениеЗаполнено(СтрокаОплаты.ПредметОбучения), СтрокаОплаты.ПредметОбучения, Неопределено),
					Граница);
				Долг = Макс(-Остаток, 0);
			КонецЕсли;
		КонецЕсли;
		ЗаДолг = Мин(Долг, СтрокаОплаты.Сумма);
		Если ЗаДолг > 0 Тогда
			Позиции.Добавить(Позиция(СтрокаОплаты.ПредметОбучения, ЗаДолг, "ПередачаСПолнойОплатой"));
			Долги.Вставить(Ключ, Долг - ЗаДолг);
		КонецЕсли;
		Вперед = СтрокаОплаты.Сумма - ЗаДолг;
		Если Вперед > 0 Тогда
			Позиции.Добавить(Позиция(СтрокаОплаты.ПредметОбучения, Вперед, "ПредоплатаПолная"));
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Функция Позиция(ПредметОбучения, Сумма, СпособРасчета)

	Наименование = НСтр("ru = 'Оплата занятий'");
	Если ЗначениеЗаполнено(ПредметОбучения) Тогда
		Наименование = Наименование + ": " + СокрЛП(ПредметОбучения);
	КонецЕсли;
	Возврат Новый Структура("Наименование, Количество, Цена, Сумма, СпособРасчета, ПредметРасчета",
		Лев(Наименование, 128), 1, Сумма, Сумма, СпособРасчета, "Услуга");

КонецФункции

//Кому чек (контакты для электронного чека): плательщик прихода; нет — ученик, если он в документе один.
Функция ПлательщикПрихода(Документ)

	Если ЗначениеЗаполнено(Документ.Плательщик) Тогда
		Возврат Документ.Плательщик;
	КонецЕсли;
	Ученики = Документ.РасшифровкаПлатежа.Выгрузить(, "Ученик");
	Ученики.Свернуть("Ученик");
	Если Ученики.Количество() = 1 Тогда
		Возврат Ученики[0].Ученик;
	КонецЕсли;
	Возврат Справочники.УЗ_ФизЛица.ПустаяСсылка();

КонецФункции

//Телефон покупателя в формате кассы «+{цифры}»: 8XXXXXXXXXX и XXXXXXXXXX (10 цифр) — российский номер +7.
//Не похоже на номер — "".
Функция НомерТелефона(Телефон)

	Цифры = "";
	Для НомерСимвола = 1 По СтрДлина(Телефон) Цикл
		Символ = Сред(Телефон, НомерСимвола, 1);
		Если СтрНайти("0123456789", Символ) > 0 Тогда
			Цифры = Цифры + Символ;
		КонецЕсли;
	КонецЦикла;
	Если СтрДлина(Цифры) = 10 Тогда
		Цифры = "7" + Цифры;
	ИначеЕсли СтрДлина(Цифры) = 11 И Лев(Цифры, 1) = "8" Тогда
		Цифры = "7" + Сред(Цифры, 2);
	КонецЕсли;
	Если СтрДлина(Цифры) < 11 Или СтрДлина(Цифры) > 15 Тогда
		Возврат "";
	КонецЕсли;
	Возврат "+" + Цифры;

КонецФункции

Функция ИмяКассира()

	ПользовательИБ = ПользователиИнформационнойБазы.ТекущийПользователь();
	Если ПользовательИБ <> Неопределено И Не ПустаяСтрока(ПользовательИБ.ПолноеИмя) Тогда
		Возврат СокрЛП(ПользовательИБ.ПолноеИмя);
	КонецЕсли;
	Пользователь = УЗ_Среда.ТекущийПользователь();
	Возврат ?(ЗначениеЗаполнено(Пользователь), Строка(Пользователь), НСтр("ru = 'Администратор'"));

КонецФункции

#КонецОбласти
